company_text = (
    '''
ООО «Газпром энергохолдинг индустриальные активы» — группа промышленных, научно-производственных и сервисных компаний с общей численностью сотрудников более 6000 человек.

Это специализированная компания Группы «Газпром энергохолдинг», созданная в 2019 году для:

• Консолидации машиностроительных и ремонтно-сервисных активов в сфере энергетического машиностроения

• Предоставления сервисных услуг по принципу «единого окна»

Сегодня компания объединяет 8 предприятий с уникальной историей и опытом и является ключевым игроком на рынке производства энергетического оборудования и оказания сервисных услуг.

Мы реализуем сложные технические задачи, обеспечивая безаварийную и эффективную работу предприятий:

 🛢 Нефтегазовой отрасли

 ⚗️ Химической промышленности

 ⚙️ Металлургии

 ⚡ Энергетики

'''

# '⚡️ ПАО «Вторая генерирующая компания оптового рынка электроэнергии» (краткое наименование – ПАО «ОГК-2») создана 9 марта 2005 года. Контролирующим акционером компании является ООО «Газпром энергохолдинг» (100-процентное дочернее общество ПАО «Газпром»). ПАО «ОГК-2» - крупнейшая российская компания тепловой генерации с установленной мощностью 16,3 ГВт.\n\n'
# 'Основные виды деятельности:\n'
# '• Производство и продажа электрической энергии (мощности) и тепловой энергии.\n'
# '• Основной рынок сбыта – оптовый рынок электрической энергии (мощности).\n\n'
# 'Компания обеспечивает эксплуатацию энергетического оборудования в соответствии с действующими нормативными требованиями и проводит своевременный и качественный ремонт, техническое перевооружение и реконструкцию энергетических объектов.\n\n'
# '🗺️ Компания осуществляет свою деятельность в 14 регионах РФ и насчитывает более 6 тыс. человек.'

)


motivations_programms = [
    ('Мы поддерживаем карьерные маршруты! Почти 70% действующих директоров электростанций прошли путь от машиниста-обходчика до первого руководителя.\n'
    'Для содействия развитию потенциала и формирования деловых качеств молодых работников в корпоративном учебном центре реализуется Школа молодого специалиста,\n'
    'проводятся образовательные программы по развитию управленческих компетенций 🔝'),

    ('Мы используем широкий спектр форм обучения и учебных программ для развития технических и управленческих компетенций,\n'
    'стимулирования инновационной и рационализаторской деятельности.\n'
    'Постоянное совершенствование подходов к организации и выбору средств и форм обучения\n'
    'позволяет создавать условия для поддержания квалификации персонала и достижения бизнес-задач 📈'),

    ('Соревнования оперативного персонала основных производственных цехов, ремонтного персонала,\n'
    'специалистов подразделений по охране труда и промышленной безопасности, а также кадровых служб\n'
    'являются формой обучения, состязанием и площадкой для обмена опытом.\n'
    'Участники проявляют своё мастерство в условиях, соответствующих реальным производственным задачам.\n'
    'Профессионализм, взаимовыручка и сплочённость — основные факторы успеха команд ПАО «ОГК-2» 🤝🏻'),

    ('🏒 Хоккей, футбол, плавание, стрельба, теннис...\n'
    'Выберите нужную опцию и присоединяйтесь к команде чемпионов!🥇'),

    ('С нами интересно! От творческих конкурсов до сдачи норм ГТО:\n'
    'мы стремимся к гармоничному балансу работы и увлечений,\n'
    'болеем за наши спортивные команды и гордимся их достижениями,\n'
    'поддерживаем творческие инициативы 💡'),

    ('Мы убеждены, что инициативы Совета молодых специалистов — волонтёрство,\n'
    'благотворительные, экологические и добровольческие инициативы —\n'
    'способны сделать нас и мир вокруг нас немного лучше.\n'
    'Присоединяйся к нам!🤗'),
]


company_benefit = (
    '''
В нашей компании создаются благоприятные условия для стабильной, комфортной и интересной работы!🌟 

Что мы предлагаем:

1️⃣Конкурентный уровень заработной платы

2️⃣Система оплаты труда, льгот и компенсаций, соответствующая стандартам ПАО «Газпром»

3️⃣Расширенный социальный пакет:
• Добровольное медицинское страхование (ДМС)
• Льготы и компенсации
• Дополнительные премии, доплаты и стимулирующие выплаты
• Семейные программы
• Материальная помощь в различных жизненных ситуациях

4️⃣Поддержка здорового образа жизни:
• Организация спортивных мероприятий
• Компенсация расходов на посещение спортивно-оздоровительных учреждений

5️⃣Обучение и развитие персонала:
• Повышение квалификации
• Возможность обучения в собственных учебных центрах, так и во внешних образовательных учреждениях

Мы высоко ценим:

 • профессионализм 

 • компетентность

 • проактивность

 • ответственное отношение к делу

 • стремление к постоянному развитию

Приглашаем присоединиться к нашей команде людей, разделяющих наши ценности, в том числе приоритет профессиональной и инициативной работы, партнерства, взаимного уважения и открытости к диалогу. 

Мы рады новым сотрудникам и новым талантам! 🎉
'''


# 'Преимущества работы в ПАО «ОГК-2»:\n'
# '🤝🏻 Строгое соблюдение ТК РФ, своевременная выплата заработной платы 2 раза в месяц.\n'
# '💰 Дополнительные стимулирующие выплаты (ежемесячная премия по итогам работы, выплаты к отпуску, к профессиональному празднику и пр.)\n'
# '🏥 Социальные гарантии, ДМС, негосударственное пенсионное обеспечение.\n'
# '⚙ Современное оборудование и технологии, возможность развития технических компетенций.\n'
# '👥 Команда экспертов, возможности для карьерного роста.\n'
# '🎉 Корпоративные мероприятия (спортивные мероприятия, конкурсы профессионального мастерства, культурно-массовые мероприятия для сотрудников и их семей, корпоративные подарки детям сотрудников).\n'
# '🏠 Возможна компенсация аренды жилья для иногородних (в отдельных филиалах).\n'
# '🦺 Обеспечение средствами индивидуальной защиты и спецодеждой.\n'
# '🎓 Возможности обучения и повышения квалификации за счет средств предприятия.\n'
# '🌍 Расположение электростанций в 13 регионах РФ – выбери место для работы и жизни!\n\n'
# '✨ Построй свою карьеру с ПАО «ОГК-2»!'
)


company_filiales = (
    '''
Предприятия Группы Газпром энергохолдинг индустриальные активы:

– Производят и внедряют современное газотурбинное и компрессорное оборудование 

– Предоставляют услуги в области инжиниринга, капитального ремонта и технического обслуживания газотурбинных установок, газоперекачивающих агрегатов, механического оборудования компрессорных станций магистральных газопроводов и других объектов нефтяной и газовой промышленности

– Выполняют проектные работы по строительству и реконструкции и перевооружению технологически сложных промышленных объектов⚙️

В состав Группы входят:

1. 🏭 АО «Невский завод» (г. Санкт-Петербург)

2. 🏭 ПАО «Тюменские моторостроители» (г. Тюмень)

3. 🏭 АО «Газэнергосервис» (г. Москва):

 – Завод «Турборемонт» (г. Брянск)

 – Завод «РТО» (г. Щёкино, Тульская обл.)

 – Завод «Ротор» (г. Камышин, Волгоградская обл.)

 – Завод «Турбодеталь» им. И.И. Соколовского (г. Наро-Фоминск, Московская обл.)

4. 🏭 АО «Уралтурбо» (г. Екатеринбург)

5. 🏭 ООО «Газпром энергохолдинг литейные технологии» (г. Узловая, Тульская обл.)
'''


    # '🔄 Электростанции (филиалы) ПАО «ОГК-2» расположены в Северо-Западном, Центральном, Южном, Северо-Кавказском, Уральском и Дальневосточном федеральных округах.\n\n'
    # '➖ Адлерская ТЭС — Краснодарский край, г. Сочи, Адлерский район, ул. Суздальская, д. 1А.\n'
    # '➖ Амурская область — Свободненская ТЭС, муниципальный район Свободненский, сельское поселение Дмитриевский сельсовет, посёлок Юхта, здание 1.\n'
    # '➖ Грозненская ТЭС — Чеченская Республика, г. о. город Грозный, г. Грозный, р-н Шейх-Мансуровский, ул. Имени Мохаммеда Бен Зайеда Аль Нахайяна, зд. 93, стр. 9.\n'
    # '➖ Киришская ГРЭС — Ленинградская область, Киришский район, г. Кириши, ш. Энтузиастов, здание 32.\n'
    # '➖ Новочеркасская ГРЭС — Ростовская область, г. Новочеркасск, ш. Багаевское, д. 10.\n'
    # '➖ Псковская ГРЭС — Псковская область, Дедовичский район, р. п. Дедовичи.\n'
    # '➖ Рязанская ГРЭС — Рязанская область, Пронский район, г. Новомичуринск, ул. Промышленная, д. 1.\n'
    # '➖ Серовская ГРЭС — Свердловская область, Серовский городской округ, г. Серов, ул. Пристанционная, 1.\n'
    # '➖ Ставропольская ГРЭС — Ставропольский край, Изобильненский район, посёлок Солнечнодольск, ул. Техническая, д. 14.\n'
    # '➖ Сургутская ГРЭС-1 — Ханты-Мансийский автономный округ — Югра, г. о. Сургут, г. Сургут, ул. Электротехническая, зд. 23/1.\n'
    # '➖ Троицкая ГРЭС — Челябинская область, г. Троицк, филиал ПАО «ОГК-2» — Троицкая ГРЭС.\n'
    # '➖ Череповецкая ГРЭС — Вологодская область, Кадуйский район, рп Кадуй, ул. Промышленная, д. 2.\n'
)

main_actions = (

    '''
Основные направления деятельности:

1. Производство и комплексные поставки высокотехнологичного газоперекачивающего оборудования для ключевых объектов реконструкции и нового строительства в рамках развития системы магистральных газопроводов и освоения газовых месторождений;

2. Предоставление сервисно-ремонтных услуг для предприятий газовой, нефтяной и энергетической промышленности:

 – изготовление запасных частей
 – инженерно-конструкторское сопровождение
 – капитальный ремонт и техническое обслуживание агрегатов

3. Разработка, изготовление и комплексные поставки энергетического оборудования для:

 – предприятий ТЭК
 – атомной отрасли
 – нефтяной и нефтехимической промышленности
 – металлургии
 – машиностроения

 '''

)



FAQ = [
    (
        'Список необходимых документов:\n'
        '➖ паспорт;\n'
        '➖ документы об образовании;\n'
        '➖ СНИЛС;\n'
        '➖ трудовая книжка (сведения о трудовой деятельности);\n'
        '➖ документы воинского учёта 📃'
    ),

    (
        'В компании реализуются программы для поддержки профессионального развития и должностного роста работников:\n'
        '➖ кадровый резерв;\n'
        '➖ профессиональное обучение и повышение квалификации;\n'
        '➖ наставничество;\n'
        '➖ конкурсы профессионального мастерства;\n'
        '➖ целевые программы обучения для молодых специалистов 📈'
    ),

    (
        'Компания обеспечивает социальную защищённость работников за счёт:\n'
        '➖ коллективного договора (выплаты и льготы в различных жизненных ситуациях);\n'
        '➖ негосударственного пенсионного обеспечения;\n'
        '➖ страхования от несчастных случаев;\n'
        '➖ добровольного медицинского страхования (после испытательного срока).'
    ),

    (
        'Информацию о графике работы вы можете узнать по телефону справочной службы:\n'
        '8-800-30-20-10-9 📅'
    ),

    (
        'Вакансии, на которые можно трудоустроиться без опыта работы и, при необходимости,\n'
        'пройти дополнительное обучение за счёт средств предприятия:\n'
        '➖ машинист обходчик по котельному/турбинному оборудованию;\n'
        '➖ аппаратчик химводоочистки;\n'
        '➖ электромонтёр по ремонту и обслуживанию электрооборудования электростанции;\n'
        '➖ слесарь по ремонту парогазотурбинного оборудования;\n'
        '➖ лаборант химического анализа;\n'
        '➖ слесарь по ремонту оборудования котельных и пылеприготовительных цехов 🔧'
    ),

    (
        'Единый телефон справочной службы: 8-800-30-20-10-9.\n'
        'С 9:00 до 18:00 по местному времени наши специалисты готовы ответить на ваши вопросы 📞'
    ),
    

]


student_pactice_text = (
'В филиалах ПАО «ОГК-2» организуется производственная и преддипломная практика для студентов,\n'
'получающих высшее и среднее профессиональное образование в области тепловой электроэнергетики ("теплоэнергетика и теплотехника",\n'
'"электроэнергетика и электротехника", "техническая эксплуатация и обслуживание электрического и электромеханического оборудования" и др.).\n'
'Под руководством квалифицированных наставников вы сможете приобрести практический опыт в условиях реального производства.\n'
'Для получения дополнительной информации обращайтесь в филиалы ПАО «ОГК-2» по указанным контактам\n'
'или по телефону прямой линии (8-800-30-20-10-9).'
)

student_study_text = (
'Компания ПАО «ОГК-2» имеет возможность заключать договоры целевого обучения с абитуриентами и студентами учреждений высшего и среднего профессионального образования.\n'
'Целевой договор – это трехсторонний договор между абитуриентом или студентом, образовательной организацией и будущим работодателем,\n'
'в соответствии с которым в период обучения студенту будут предоставлены дополнительные меры социальной поддержки и гарантировано трудоустройство по завершению обучения.\n'
'За более подробной информацией о возможности заключения целевого договора обращайтесь по указанным контактам\n'
'или по телефону прямой линии (8-800-30-20-10-9). '
)

student_cooperation_text = (
'ПАО «ОГК-2» имеет договоры о социальном партнерстве с учреждениями высшего и среднего профессионального образования в различных регионах страны.\n'
'Мы рады видеть вас на наших мероприятиях, проводимых в учебных заведениях: Ярмарках вакансий, Днях открытых дверей, Днях карьеры.\n'
'Анонсы проводимых мероприятий размещаются на официальном сайте компании www.ogk2.ru.\n'
'Для получения дополнительной информации обращайтесь в филиалы ПАО «ОГК-2» по указанным контактам\n'
'или по телефону прямой линии (8-800-30-20-10-9). '
)

student_time_work_text = (
'На период производственной и преддипломной практики вы можете быть трудоустроены в филиалы компании и стать полноправным участником нашей команды!\n'
'Для уточнения информации о возможности трудоустройства в конкретный филиал обращайтесь по указанным контактам\n'
'или по телефону прямой линии (8-800-30-20-10-9).'
)


social_media_text = (

'''
Присоединяйтесь к нам в социальных сетях и будьте в курсе всех событий! 📲

 ▶️ Rutube: https://rutube.ru/channel/24798751/
 💬 ВКонтакте: https://vk.com/gehia_live
 ✈️ Telegram: https://t.me/gehia_live

🌐 https://www.gehia.ru/

'''

)




