admin_main_menu_keyboard = [
    ['Ищу работу', 'region'],
    # ['Я студент', 'student'],
    ['О компании', 'about_company'],
    # ['Частые вопросы', 'FQA'],
    ['Отправить анкету', 'user_data'],
    ['Контактная информация', 'contacts'],
    ['Социальные сети', 'social_media'],
    ['Панель администратора', 'admin_soft']
]

admin_options_keyboard = [["Рассылка"], ["Метрика"], ["Главное меню"]]

user_main_menu_keyboard = [
    ['Ищу работу', 'region'],
    # ['Я студент', 'student'],
    ['О компании', 'about_company'],
    # ['Частые вопросы', 'FQA'],
    ['Отправить анкету', 'user_data'],
    ['Контактная информация', 'contacts'],
    ['Социальные сети', 'social_media'],
]

vacancies_menu_keyboard = [
    ['Все вакансии'],
    ['Вакансии по направлениям деятельности'],
    ['Без опыта работы'],
    ['Главное меню']
]

warning_options_keyboard = [
    ['Да, я готов 🔍'],
    ['Главное меню'],

]

vacancies_categories_keyboard = [
    ['Производство'],
    ['Офисные подразделения'],
    ['Стажировка'],
    ['Главное меню']
]

power_vacancies_keyboard = [
    ['Теплоэнергетика', 'Электроэнергетика'],
    ['АСУ ТП', 'РЗА'],
    ['Ремонт', 'Химия'],
    ['HR', 'ИТ'],
    ['Экономика', 'Сбыт'],
    ['Промышленная безопасность и охрана труда'],
    ['Другое', 'Главное меню']
]

office_vacancies_keyboard = [
    ['Закупки', 'Экономика'],
    ['HR', 'Сбыт', 'ИТ'],
    ['Юриспруденция', 'Производственное управление'],
    ['Промышленная безопасность и охрана труда'],
    ['Главное меню']
]

about_company_keyboard = [
    ['Работай с нами'],
    ['Филиалы'],
    ['Корпоративная жизнь'],
    ['Главное меню'],
]
    
motivations_programms_keyboard = [
    ['Кадровый резерв и преемственность'],
    ['Обучение и развитие'],
    ['Конкурсы профессионального мастерства '],
    ['Спорт'],
    ['Культурно-массовые мероприятия'],
    ['Совет молодых специалистов'],
    ['Главное меню'],
]

FAQ_keyboard = [
    ['Какие документы мне понадобятся при трудоустройстве?'],
    ['Какие карьерные возможности есть в компании?'],
    ['Какие социальные гарантии и льготы мне предоставят?'],
    ['По какому графику я буду работать?'],
    ['На какие вакансии я могу претендовать без опыта работы?'],
    ['Кому я могу задать дополнительные вопросы?'],
    ['Главное меню'],

]