welcome_text = (
'''
Рады приветствовать вас в чат-боте для поиска работы в ООО «Газпром энергохолдинг литейные технологии»!

Что может делать данный бот?

📌 Выдавать актуальные вакансии по ключевым словам, городам присутствия и категориям специальностей

⚙️ Рассказывать о преимуществах работы в компании 

Информировать о новых вакансиях

❓ Давать ответы на самые частые вопросы

Просто напишите интересующую вас вакансию, например:
«модельщик», «инженер-технолог» или даже «стажёр».

Ииииии… Поехали! 🚀
Стань частью сильной команды! 💪
'''
)

welcome_two = (
    'Если вы уже готовы приступить к поиску, напишите нам ключевое слово вакансии в ответном сообщении, например: «без опыта» или «электрик» и мы выдадим вам результаты!'
)

inf_contacts_text = (
    'Специалист свяжется с вами в ближайшее время 📞\n\n'
    'Если вам не терпится связаться с нами, то позвоните по номеру  +7 (906) 536-69-61\n'
)

contacts_info = (
'''
Связаться с нами 📞
Если у вас остались вопросы — звоните или пишите, мы вам будем рады!

📱: +7 (906) 536-69-61
✉️ d.grigorova@gehlt.ru
🌐 https://www.gehia.ru/subsidiaries/gehlt/
'''
)


social_media = (
    '''
Присоединяйтесь к нам в социальных сетях и будьте в курсе всех событий! 📲

 ▶️ Rutube: https://rutube.ru/channel/24798751/
 💬 ВКонтакте: https://vk.com/gehia_live
 ✈️ Telegram: https://t.me/gehia_live
 🌐 https://www.gehia.ru/
    '''
    )

FQA_info = (
'''  
Адрес ООО «Газпром энергохолдинг литейные технологии»:

📍 Тульская область, особая экономическая зона «Узловая»

Какие документы понадобятся при трудоустройстве? 📑

Для оформления на работу необходимо подготовить следующие документы:

 🪪 Паспорт гражданина РФ

 🎓 Документы об образовании

 🟩 СНИЛС

 🧾 ИНН

 📘 Трудовая книжка

 🎖 Документы воинского учёта (для военнообязанных)
'''
)