welcome_text = (
'''
Рады приветствовать вас в чат-боте для поиска работы на Невском заводе

Что может делать данный бот?

📌 Выдавать актуальные вакансии по ключевым словам, городам присутствия и категориям специальностей

⚙️ Рассказывать о преимуществах и возможностях работы в компании

Информировать о новых вакансиях

❓ Давать ответы на самые частые вопросы

Просто напишите интересующую вас вакансию, например:
«оператор станков», «инженер» или даже «стажёр»

Ииииии… Поехали! 🚀
Стань частью сильной команды! 💪
'''
)

welcome_two = (
    'Если вы уже готовы приступить к поиску, напишите нам ключевое слово вакансии в ответном сообщении, например: «без опыта» или «электрик» и мы выдадим вам результаты!'
)

inf_contacts_text = (
    'Специалист свяжется с вами в ближайшее время 📞\n\n'
    'Если вам не терпится связаться с нами, то позвоните по номеру  +7 (906) 536-69-61\n'
)

contacts_info = (
'''
Если у вас остались вопросы — просто пишите нам, мы вам будем рады!

Контакты 📬
✉️ rabotaNZL@reph.ru
🌐 www.nzl.ru
'''
)


social_media = (
    '''
Присоединяйтесь к нам в социальных сетях и будьте в курсе всех событий! 📲

 ▶️ Rutube: https://rutube.ru/channel/24798751/
 💬 ВКонтакте: https://vk.com/gehia_live
 ✈️ Telegram: https://t.me/gehia_live
 🌐 https://www.gehia.ru/
    '''
    )


FQA_info = (
    '''
Какие документы понадобятся при трудоустройстве? 📑

Подготовьте следующий пакет документов:

 🪪 Паспорт гражданина РФ;

 🎓 Документы об образовании;

 📄 Документы, подтверждающие квалификацию;

 🟩 СНИЛС;

 🧾 ИНН;

 📘 Трудовая книжка;

 🎖 Документы воинского учёта (для военнообязанных).

Адрес:
📍г. Санкт-Петербург, пр. Обуховской Обороны, д. 51
'''
)