welcome_text = (
'''
Рады приветствовать вас в чат-боте для поиска работы в Группе Газпром энергохолдинг индустриальные активы!

Что может делать данный бот?

📌 Выдавать актуальные вакансии по ключевым словам, городам присутствия и категориям специальностей

⚙️ Рассказывать о преимуществах работы в компании 

📩 Информировать о новых вакансиях

❓ Давать ответы на самые частые вопросы

Просто напишите интересующую вас вакансию, например:
«фрезеровщик», «инженер» или даже «стажёр».

Ииииии… Поехали! 🚀
Стань частью сильной команды! 💪
'''
)

welcome_two = (
    'Если вы уже готовы приступить к поиску, напишите нам ключевое слово вакансии в ответном сообщении, например: «без опыта» или «электрик» и мы выдадим вам результаты!'
)

inf_contacts_text = (
    'Специалист свяжется с вами в ближайшее время 📞\n\n'
    'Если вам не терпится связаться с нами, то позвоните по номеру  +7 (906) 536-69-61\n'
)

contacts_info = (
'''
Управляющая компания
🏢 ООО «Газпром энергохолдинг индустриальные активы» (г. Санкт-Петербург)
🌐 www.gehia.ru
✉️ career@gehia.ru
⸻
Дочерние общества:

🏭 АО «Невский завод» (г. Санкт-Петербург)
✉️ rabotaNZL@reph.ru
🌐 www.nzl.ru

🏭 ПАО «Тюменские моторостроители» (г. Тюмень)
✉️ kadry@tmotor.ru
✉️ k.haibabulina@tmotor.ru
🌐 https://www.tmotor.ru 

🏭 АО «Газэнергосервис» (г. Москва)
✉️ adm@gesturbo.ru
🌐 www.gesturbo.ru

 • Завод «Турборемонт» (г. Брянск): e.matusevich@turboremont.gesturbo.ru

 • Завод «РТО» (г. Щёкино, Тульская обл.): t.novikova@zavod-rto.su

 • Завод «Ротор» (г. Камышин, Волгоградская обл.): ok@rotorcom.ru

 • Завод «Турбодеталь» им. И.И. Соколовского (г. Наро-Фоминск, Московская обл.): ok@turbonara.ru

🏭 АО «Уралтурбо» (г. Екатеринбург)
✉️ personal@urtu.ru
🌐 www.urtu.ru

🏭 ООО «Газпром энергохолдинг литейные технологии» (г. Узловая)
✉️ d.grigorova@gehlt.ru
🌐 https://www.gehia.ru/subsidiaries/gehlt/
'''
)


social_media = (
    '''
Присоединяйтесь к нам в социальных сетях и будьте в курсе всех событий! 📲

 ▶️ Rutube: https://rutube.ru/channel/24798751/
 💬 ВКонтакте: https://vk.com/gehia_live
 ✈️ Telegram: https://t.me/gehia_live
 🌐 https://www.gehia.ru/
    '''
    )
