region_voc = {
    'Санкт-Петербург': 'Санкт-Петербург', 
    'Москва': 'Москва',
    'Московская Область': 'Московская Область',
    'Тюмень': 'Тюмень',
    'Брянск': 'Брянск',
    'Щекино, Тульская обл.': 'Щекино', #, Тульская обл.',
    'Камышин, Волгоградская обл.': 'Камышин', # , Волгоградская обл.
    'Екатеринбург': 'Екатеринбург',
    'Узловая': 'Узловая'
}


region_list = [
    'Санкт-Петербург',
    'Москва',
    'Московская Область',
    'Тюмень',
    'Брянск',
    'Щекино',
    'Тульская обл.',
    'Камышин',
    'Екатеринбург',
    'Узловая'
]



region_buttons_list = [
    ['Санкт-Петербург'],
    [' Москва'],
    ['Московская Область'],
    ['Тюмень'],
    ['Брянск'],
    ['Щекино, Тульская обл.'],
    ['Камышин, Волгоградская обл.'],
    ['Екатеринбург'],
    ['Узловая']
]